# suscriptor

In [28]:
import ssl
import sys
import psycopg2
import paho.mqtt.client
import json
from sqlalchemy import create_engine
import pandas as pd
import sub

# conexión con la base de datos

In [29]:
host='echo.db.elephantsql.com'
user ='fvrwybpi'
password='Vm7b24osfoJddQLWdc6VotSmYBpOn0UT'
dbname='fvrwybpi'

In [30]:
connection = psycopg2.connect(host = host,
                                user= user, password =password,
                                dbname= dbname)

# creación de tablas

In [4]:
%%time
query_file = open("Data/Tablas.sql",'r') 
query = query_file.read()
cur = connection.cursor()
cur.execute(query)
cur.close()
connection.commit()

Wall time: 4.85 s

# borrar data

In [5]:
%%time
query_file = open("Data/Delete-Data.sql",'r') 
query = query_file.read()
cur = connection.cursor()
cur.execute(query)
cur.close()
connection.commit()

Wall time: 8.51 s

# agregar data de los clientes

In [6]:
query_file = open("Data/Data.sql",'r', encoding='utf-8') 
query = query_file.read()
cur = connection.cursor()
cur.execute(query)
cur.close()
connection.commit()

# pretty select

In [11]:
def pretty_select(query):
    db_connection = 'postgres://{}:{}@{}:5432/{}'.format(user, password, host, dbname)
    try:
        engine = create_engine(db_connection)
        dataframe = pd.read_sql_query(query, engine)
    except Exception as e:
        print('Error en el query:', e)
    else:
        engine.dispose()
        return dataframe

# queries

## 1.

Cuales son los clientes conocidos y desconocidos que mas han comprado en cada una de las tiendas.
Este query trae los clientes que mas han comprado por sucursal y que estan dentro del programa de fidelidad y cuenta cada vez que compran por sucursal, se agrupan por sucusal se ordenan por cantidad de veces que compran. Luego del union vienen los clientes que no estan en el plan de fidelidad.

In [51]:
query = """ 
select count(cliente.id_cliente), cliente.id_cliente, cliente.nombre, sucursal.ubicacion from cliente 
join factura on cliente.id_cliente = factura.id_cliente join sucursal on factura.id_sucursal = sucursal.id_sucursal 
where cliente.id_cliente in (select distinct id_cliente from cuenta_programa_fidelidad) group by 2,3,4 order by 1 ASC limit 3"""
pretty_select(query)

   count  id_cliente     nombre           ubicacion
0      1          34  Miguelita  Terrazas del Ávila
1      1          17     Alanna  Terrazas del Ávila
2      1          25       Wilt  Terrazas del Ávila

In [52]:
query = """
select count(cliente.id_cliente), cliente.id_cliente, cliente.nombre, sucursal.ubicacion from cliente 
join factura on cliente.id_cliente = factura.id_cliente join sucursal on factura.id_sucursal = sucursal.id_sucursal 
where cliente.id_cliente not in (select distinct id_cliente from cuenta_programa_fidelidad) group by 2,3,4 order by 1 ASC limit 3"""
pretty_select(query)

   count  id_cliente   nombre           ubicacion
0      1          18   Ashlan   Los Palos Grandes
1      1          27  Brietta  Terrazas del Ávila

## 2.

Diga cual es la categoría de producto que menos se ha vendido en cada una de las tiendas.
Este query cuenta la cantidad de veces que un id_producto sale en un detalle factura, es agrupado por categoria, ordenado de menor a mayor y tiene un limite de 1. Para obtener la categoria que menos sale.

In [53]:
query = """
select count(producto.categoria), producto.categoria, factura.id_sucursal from producto 
join detalle_factura on producto.id_producto = detalle_factura.id_producto join factura 
on detalle_factura.id_factura = factura.id_factura where factura.id_sucursal = 1 group by 2,3 order by 1 ASC limit 1
"""
pretty_select(query)

   count categoria  id_sucursal
0      1  Cereales            1

In [54]:
query = """
select count(producto.categoria), producto.categoria, factura.id_sucursal from producto 
join detalle_factura on producto.id_producto = detalle_factura.id_producto join factura 
on detalle_factura.id_factura = factura.id_factura where factura.id_sucursal = 2 group by 2,3 order by 1 ASC limit 1
"""
pretty_select(query)

   count categoria  id_sucursal
0      1   Frescos            2

## 3.

Cuales es el top 5 de productos que mas se han vendido en cada una de las tiendas. Este query trae la cantidad de productos vendidos, el id del producto, el nombre, y la ubicacion. Los agrupa por id,nombre y ubicacion y se ordena de mayor a menor por la cantidad de producto y se limit a 5 del top 5.

In [55]:
query = """
select count(producto.id_producto), producto.id_producto, producto.nombre, factura.id_sucursal from producto 
join detalle_factura on producto.id_producto = detalle_factura.id_producto join factura 
on detalle_factura.id_factura = factura.id_factura where factura.id_sucursal = 1 group by 2,3,4 order by 1 DESC limit 5
"""
pretty_select(query)

   count  id_producto          nombre  id_sucursal
0      2            8    Pan de Trigo            1
1      1            3     Mantequilla            1
2      1            7  Crema de Leche            1
3      1           16    Lucky Charms            1
4      1           22          Salami            1

In [56]:
query = """
select count(producto.id_producto), producto.id_producto, producto.nombre, factura.id_sucursal from producto 
join detalle_factura on producto.id_producto = detalle_factura.id_producto join factura 
on detalle_factura.id_factura = factura.id_factura where factura.id_sucursal = 2 group by 2,3,4 order by 1 DESC limit 5
"""
pretty_select(query)

   count  id_producto          nombre  id_sucursal
0      2           35  Leche en Polvo            2
1      1           32          Harina            2
2      1           44           Limón            2
3      1           45          Huevos            2

## 4.

Diga todos los clientes que en los últimos 7 días a partir de la ejecución del query han comprado solo en una tienda y los que han comprado en las dos tiendas (realice queries distintos).

In [57]:
query ="""
select cliente.id_cliente, cliente.nombre, cliente.apellido from cliente 
where exists (select distinct id_cliente from factura where factura.id_cliente = cliente.id_cliente and 
factura.fecha_hora > current_date - interval '7 days' group by 1 having count(distinct id_sucursal) = 1)
"""
pretty_select(query)

   id_cliente     nombre     apellido
0          27    Brietta        Peers
1          17     Alanna  Biddlecombe
2          18     Ashlan       Rhymes
3          25       Wilt     Chrishop
4          29      Jacob      Belleny
5          34  Miguelita   Fonquernie

In [58]:
query ="""
select cliente.id_cliente, cliente.nombre, cliente.apellido from cliente 
where exists (select distinct id_cliente from factura where factura.id_cliente = cliente.id_cliente 
and factura.fecha_hora > current_date - interval '7 days' group by 1 having count(distinct id_sucursal) > 1)
"""
pretty_select(query)

   id_cliente nombre apellido
0          40  Kacey     Oehm

## 5.

Haga un análisis por estante de cuales categorías de producto tienen mayor rotación de inventario y haga una propuesta de modificación

In [59]:
query ="""
SELECT COUNT(I.id_producto), P.categoria, A.id_estante FROM inventario AS I INNER JOIN producto AS P ON I.id_producto = P.id_producto 
INNER JOIN producto_asignado AS A ON I.id_producto = A.id_producto 
GROUP BY A.id_estante, P.categoria ORDER BY COUNT(I.id_producto) DESC;
"""
pretty_select(query)

    count       categoria  id_estante
0       6  No Perecederos          12
1       5       Vegetales          13
2       5  No Perecederos          11
3       4         Lácteos           1
4       4          Frutas          14
5       4        Cereales           6
6       4       Panadería           3
7       4          Frutas          15
8       3       Enlatados           9
9       3         Bebidas           4
10      3         Bebidas           5
11      3     Charcutería          10
12      3         Frescos          16
13      3     Charcutería           2
14      2       Enlatados           7
15      2          Frutas          16
16      2     Charcutería           8
17      2         Lácteos           3
18      1  No Perecederos           7
19      1       Vegetales          14
20      1        Galletas           9
21      1        Galletas           8

## 6.

Encuentre a todos los clientes que han pagado con 2 bancos distintos en la ultima semana. Enumérelos y diga si son parte del programa de afiliados.

In [60]:
query ="""
select cliente.id_cliente, cliente.nombre, cliente.apellido from cliente 
where exists (select distinct id_cliente from factura where factura.id_cliente = cliente.id_cliente 
and factura.fecha_hora > current_date - interval '7 days' group by 1 having count(distinct banco) > 1)
"""
pretty_select(query)

   id_cliente nombre apellido
0          40  Kacey     Oehm
1          29  Jacob  Belleny

# procedimientos almacenados

## 1.

Realizar compra: Esto procedimiento almacenado debe tener como parámetro una lista de productos con su cantidad, el banco por donde se va a cancelar y un cliente. Debe tener toda la lógica para ingresar en las distintas tablas la compra realizada.

In [4]:
query="""create or replace function realizar_pago(n_cuenta integer, id_cliente integer, banco varchar(10), 
id_sucursal integer, id_factura integer, total numeric(8,0), descuento numeric(8,0), total_pago numeric(8,0), fecha_hora timestamp) returns VOID AS
    $$
    BEGIN
        INSERT into factura (id_factura, id_cliente, fecha_hora, banco, id_sucursal, total, descuento, total_pago) VALUES
        (id_factura, id_cliente, fecha_hora, banco, id_sucursal, total, descuento, total_pago);
    END;
    $$
language plpgsql;"""


cur = connection.cursor()
cur.execute(query)
cur.close()
connection.commit()

## 2.

Haga un procedimiento almacenado que al final del día saque un estado de cuenta de cuanto dinero se tiene en cada banco.

In [5]:
query="""create or replace function estado_cuenta () returns table(banco varchar(10),total_pago numeric) AS
    $$
    BEGIN
    return QUERY 
    (SELECT factura.banco, SUM(factura.total_pago) FROM factura GROUP BY factura.banco); 
    END;
    $$
language plpgsql;"""


cur = connection.cursor()
cur.execute(query)
cur.close()
connection.commit()

In [61]:
query="""select estado_cuenta()"""
pretty_select(query)

       estado_cuenta
0    (Mercantil,576)
1     (Banesco,1904)
2  (Provincial,1219)

## 3.

Haga un procedimiento almacenado que al final del mes saque un estado de cuenta de los puntos de todos los afiliados al programa de fidelidad que compraron ese mes.

In [7]:
query="""create or replace function estado_afiliados () returns table(no_cuenta integer,
          id_cliente integer,puntos integer) AS
    $$
    BEGIN
    return QUERY
    SELECT cuenta_programa_fidelidad.no_cuenta,cuenta_programa_fidelidad.id_cliente,
    cuenta_programa_fidelidad.puntos FROM cuenta_programa_fidelidad,factura 
    WHERE (NOW()- INTERVAL '30' DAY) <= fecha_hora::Timestamp::Date; 
    END;
    $$
language plpgsql;"""


cur = connection.cursor()
cur.execute(query)
cur.close()
connection.commit()

In [62]:
query="""select estado_afiliados()"""
pretty_select(query)

    estado_afiliados
0            (0,0,0)
1           (1,20,0)
2           (2,47,0)
3           (6,36,0)
4           (8,33,0)
5           (9,48,0)
6          (13,50,0)
7          (14,24,0)
8          (15,12,0)
9          (16,38,0)
10         (17,39,0)
11         (18,46,0)
12         (19,35,0)
13         (21,13,0)
14         (22,23,0)
15         (23,21,0)
16         (24,22,0)
17          (25,6,0)
18         (4,17,33)
19         (27,29,0)
20         (28,25,0)
21         (29,34,0)
22         (26,40,4)
23         (30,40,0)
24           (0,0,0)
25          (1,20,0)
26          (2,47,0)
27          (6,36,0)
28          (8,33,0)
29          (9,48,0)
..               ...
186        (4,17,33)
187        (27,29,0)
188        (28,25,0)
189        (29,34,0)
190        (26,40,4)
191        (30,40,0)
192          (0,0,0)
193         (1,20,0)
194         (2,47,0)
195         (6,36,0)
196         (8,33,0)
197         (9,48,0)
198        (13,50,0)
199        (14,24,0)
200        (15,12,0)
201        (16,38,0)
202        (17,39,0)
203        (18,46,0)
204        (19,35,0)
205        (21,13,0)
206        (22,23,0)
207        (23,21,0)
208        (24,22,0)
209         (25,6,0)
210        (4,17,33)
211        (27,29,0)
212        (28,25,0)
213        (29,34,0)
214        (26,40,4)
215        (30,40,0)

[216 rows x 1 columns]

# extras

## 4.

Procedimiento almacenado que retorna True si un cliente pertenece al programa de fidelidad.

In [8]:
query="""
CREATE OR REPLACE FUNCTION verificar_pertenece_programa(id integer) RETURNS BOOLEAN AS
$$
DECLARE pertenece BOOLEAN;
BEGIN
    IF id = (SELECT id_cliente FROM cuenta_programa_fidelidad WHERE id_cliente = id) 
    THEN pertenece = True;
    ELSE
        pertenece = False;
    END IF;
    
    RETURN pertenece;
END
$$
  LANGUAGE 'plpgsql';
"""
cur = connection.cursor()
cur.execute(query)
cur.close()
connection.commit()

## 5.

Procedimiento almacenado que retorna True si la cantidad restante de productos en un estante es menor al 20% de su capacidad.

In [9]:
query="""
CREATE OR REPLACE FUNCTION verificar_cantidad(id integer) RETURNS BOOLEAN AS
$$
DECLARE recargar_estante BOOLEAN;
BEGIN
    SELECT (SUM(cantidad_restante) < 
    (SELECT capacidad*0.20 FROM estante_inteligente WHERE id_estante = id))
    INTO recargar_estante FROM producto_asignado WHERE id_estante = id;
    
    RETURN recargar_estante;
END
$$
  LANGUAGE 'plpgsql';
"""
cur = connection.cursor()
cur.execute(query)
cur.close()
connection.commit()

## 6.

Procedimiento almacenado que llena un estante.

In [10]:
query="""
CREATE OR REPLACE FUNCTION llenar_estante(id integer, fecha_hora timestamp) RETURNS VOID AS
$$
BEGIN
    WITH cantidades_iniciales(id_p, cantidad_i, cantidad_r) AS (SELECT id_producto, cantidad_inicial, cantidad_restante FROM producto_asignado 
    WHERE id_estante = id)
    INSERT INTO producto_asignado(id_producto, fecha_hora, id_estante, cantidad_inicial, cantidad_restante) 
    VALUES (
    (SELECT C.id_p FROM cantidades_iniciales AS C WHERE id_producto = C.id_p),
    fecha_hora, 
    id,
    (SELECT C.cantidad_i FROM cantidades_iniciales AS C WHERE id_producto = C.id_p),
    (SELECT C.cantidad_i FROM cantidades_iniciales AS C WHERE id_producto = C.id_p));
END
$$
  LANGUAGE 'plpgsql';
"""
cur = connection.cursor()
cur.execute(query)
cur.close()
connection.commit()

## 7.

Procedimiento almacenado que actualiza la cantidad restante de un producto de un estante.

In [11]:
query="""
CREATE OR REPLACE FUNCTION update_estante(id_p integer, cant integer, fecha_hora timestamp) RETURNS VOID AS
$$
BEGIN
    INSERT INTO producto_asignado(id_producto, fecha_hora, id_estante, cantidad_inicial, cantidad_restante) 
    VALUES (id_p, fecha_hora, (SELECT id_estante FROM producto_asignado WHERE id_producto = id_p LIMIT 1), 
    (SELECT cantidad_inicial FROM producto_asignado WHERE id_producto = id_p LIMIT 1), 
    (SELECT cantidad_inicial-cant FROM producto_asignado WHERE id_producto = id_p LIMIT 1)); 
END
$$
  LANGUAGE 'plpgsql';
"""
cur = connection.cursor()
cur.execute(query)
cur.close()
connection.commit()

In [12]:
query="""
CREATE OR REPLACE FUNCTION verificar_cliente(id integer) RETURNS BOOLEAN AS
$$
DECLARE is_cliente BOOLEAN;
BEGIN
    IF 
        id IN (SELECT id_cliente FROM cliente)
        THEN is_cliente = True;
    ELSE
        is_cliente = False;
    
    END IF;
    
    RETURN is_cliente;
END
$$
  LANGUAGE 'plpgsql';
"""
cur = connection.cursor()
cur.execute(query)
cur.close()
connection.commit()

## 8.

In [13]:
query="""
CREATE OR REPLACE FUNCTION verificar_cola(id integer) RETURNS BOOLEAN AS
$$
DECLARE esta_en_cola BOOLEAN;
BEGIN
    IF 
        id IN (SELECT id_cliente FROM cliente_charcuteria)
        THEN esta_en_cola = True;
    ELSE
        esta_en_cola = False;
    
    END IF;
    
    RETURN esta_en_cola;
END
$$
  LANGUAGE 'plpgsql';
"""
cur = connection.cursor()
cur.execute(query)
cur.close()
connection.commit()

# triggers

## 1.

Cada vez que entre un cliente conocido, se debe agregar 1 punto a su estado de cuenta del programa de fidelidad.

In [14]:
query="""
CREATE OR REPLACE FUNCTION add_punto_programa() RETURNS TRIGGER AS
$$
BEGIN
    IF NEW.id_cliente IN (SELECT id_cliente FROM visita) THEN 
    UPDATE cuenta_programa_fidelidad SET puntos = (SELECT puntos+1 FROM cuenta_programa_fidelidad WHERE id_cliente = NEW.id_cliente) 
    WHERE id_cliente = NEW.id_cliente;
    END IF;
    
    RETURN NEW;
END;
$$
  LANGUAGE 'plpgsql';
"""
cur = connection.cursor()
cur.execute(query)
cur.close()
connection.commit()

In [15]:
query="""
CREATE TRIGGER add_punto_programa
  AFTER INSERT 
  ON factura
  FOR EACH ROW
  EXECUTE PROCEDURE add_punto_programa();
"""
cur = connection.cursor()
cur.execute(query)
cur.close()
connection.commit()

In [43]:
query= """
select * from cuenta_programa_fidelidad;
"""
pretty_select(query)

,no_cuenta,id_cliente,fecha_suscripcion,fecha_finalizacion,foto,puntos
0,0,0,0001-01-01,0001-01-01,Ninguna,0
1,1,20,2020-07-01,2020-07-31,http://dummyimage.com/109x112.jpg/ff4444/ffffff,0
2,2,47,2020-07-01,2020-07-31,http://dummyimage.com/199x158.jpg/ff4444/ffffff,0
3,6,36,2020-07-01,2020-07-31,http://dummyimage.com/203x129.jpg/ff4444/ffffff,0
4,8,33,2020-07-01,2020-07-31,http://dummyimage.com/249x205.png/dddddd/000000,0
5,9,48,2020-07-01,2020-07-31,http://dummyimage.com/228x238.png/cc0000/ffffff,0
6,13,50,2020-07-01,2020-07-31,http://dummyimage.com/145x226.jpg/ff4444/ffffff,0
7,14,24,2020-07-01,2020-07-31,http://dummyimage.com/117x161.png/cc0000/ffffff,0
8,15,12,2020-07-01,2020-07-31,http://dummyimage.com/156x122.png/cc0000/ffffff,0
9,16,38,2020-07-01,2020-07-31,http://dummyimage.com/164x124.jpg/ff4444/ffffff,0
10,17,39,2020-07-01,2020-07-31,http://dummyimage.com/161x132.jpg/5fa2dd/ffffff,0
11,18,46,2020-07-01,2020-07-31,http://dummyimage.com/217x125.jpg/5fa2dd/ffffff,0
12,19,35,2020-07-01,2020-07-31,http://dummyimage.com/146x185.png/dddddd/000000,0
13,21,13,2020-07-01,2020-07-31,http://dummyimage.com/170x223.jpg/dddddd/000000,0
14,22,23,2020-07-01,2020-07-31,http://dummyimage.com/133x141.png/dddddd/000000,0
15,23,21,2020-07-01,2020-07-31,http://dummyimage.com/216x104.png/5fa2dd/ffffff,0
16,24,22,2020-07-01,2020-07-31,http://dummyimage.com/150x118.png/cc0000/ffffff,0
17,25,6,2020-07-01,2020-07-31,http://dummyimage.com/197x140.jpg/5fa2dd/ffffff,0
18,4,17,2020-07-01,2020-07-31,http://dummyimage.com/160x171.png/cc0000/ffffff,33
19,27,29,2020-07-01,2020-07-31,sin foto,0
20,28,25,2020-07-01,2020-07-31,sin foto,0
21,29,34,2020-07-01,2020-07-31,sin foto,0
22,26,40,2020-07-01,2020-07-31,sin foto,4
23,30,40,2020-07-01,2020-07-31,sin foto,0

## 2.

Cada vez que un cliente conocido realice una compra, se le agregaran los puntos en su programa de fidelidad.

In [16]:
query="""
CREATE OR REPLACE FUNCTION add_puntos() RETURNS TRIGGER AS
$$
BEGIN
    IF (SELECT verificar_pertenece_programa(NEW.id_cliente)) = True 
    THEN UPDATE cuenta_programa_fidelidad SET puntos = (SELECT puntos+(NEW.total_pago*0.1) FROM cuenta_programa_fidelidad 
    WHERE no_cuenta = (SELECT no_cuenta FROM cuenta_programa_fidelidad WHERE id_cliente = NEW.id_cliente)) 
    WHERE no_cuenta = (SELECT no_cuenta FROM cuenta_programa_fidelidad WHERE id_cliente = NEW.id_cliente);
    END IF;
    
    RETURN NEW;
END;
$$
  LANGUAGE 'plpgsql';
"""
cur = connection.cursor()
cur.execute(query)
cur.close()
connection.commit()

In [17]:
query="""
CREATE TRIGGER add_puntos
  AFTER INSERT 
  ON factura
  FOR EACH ROW
  EXECUTE PROCEDURE add_puntos();
"""
cur = connection.cursor()
cur.execute(query)
cur.close()
connection.commit()

In [38]:
query= """
select * from cliente;
"""
pretty_select(query)

,id_cliente,nombre,apellido,telefono,direccion
0,40,Kacey,Oehm,1.252790e+09,51 Ludington Center
1,3,Gareth,Moxson,2.742826e+09,74 Lakewood Gardens Hill
2,15,Craggy,Bottell,4.789100e+09,67359 Sherman Center
3,10,Benson,Thoumas,8.983431e+09,74 North Road
4,26,Chariot,Karpinski,2.878758e+09,00 Village Center
5,27,Brietta,Peers,3.542742e+09,066 Kings Road
6,0,Desconocido,Desconocido,0.000000e+00,Desconocida
7,1,Vania,Tamplin,8.733382e+09,3 Grover Pass
8,4,Nollie,Bertram,7.782379e+09,5012 Northview Plaza
9,5,Tann,Steabler,8.346899e+09,121 Bultman Pass
10,6,Zelda,Pauncefort,2.147699e+09,1481 Hanson Trail
11,7,Gerladina,Roglieri,6.748775e+09,7 Judy Way
12,8,Kip,Ewens,3.964824e+09,3 Portage Lane
13,12,Shoshana,Hilbourne,2.162239e+09,80 7th Avenue
14,13,Rod,Tayloe,3.929459e+09,4 Browning Circle
15,14,Arch,Helwig,6.839956e+09,7710 Kingsford Place
16,17,Alanna,Biddlecombe,2.483748e+09,880 Basil Alley
17,18,Ashlan,Rhymes,1.768938e+09,75 Schiller Parkway
18,19,Orin,Djordjevic,2.681178e+09,93739 Columbus Street
19,20,Cori,Chatres,8.225485e+09,06806 4th Drive
20,21,Ilene,Renihan,3.031758e+09,0 Vera Place
21,22,Petronilla,Pahl,9.074747e+09,8391 Hoard Place
22,23,Trixi,Lucien,1.551294e+09,8228 Hauk Court
23,24,Josey,Pagelsen,8.297700e+09,8 Dawn Center
24,25,Wilt,Chrishop,3.887587e+09,2642 Calypso Terrace
25,28,Caleb,Gallamore,9.863239e+09,707 Rutledge Plaza
26,29,Jacob,Belleny,1.913322e+09,95 Sutteridge Point
27,30,Milt,McFadden,5.723060e+09,488 Westerfield Drive
28,31,Debra,Kimbly,8.423490e+09,1474 Cascade Way
29,33,Aeriel,Klemps,5.267618e+09,13 Marcy Parkway
30,34,Miguelita,Fonquernie,8.586092e+09,514 Laurel Lane
31,35,Lucie,Sulley,3.631075e+09,28535 Meadow Vale Road
32,36,Thom,Hooban,2.692995e+09,340 Di Loreto Parkway
33,37,Melicent,Fredson,4.894379e+09,6074 Columbus Avenue
34,38,Heddie,McNeachtain,8.946957e+09,29 Weeping Birch Pass
35,39,Clarine,Hollidge,5.803973e+09,7 Cherokee Terrace
36,45,Marya,Groll,9.359365e+09,1158 Springview Crossing
37,46,Marylee,Attril,4.359432e+09,99341 Glendale Alley
38,47,Emmy,Flower,9.112608e+09,2 Wayridge Street
39,48,Felecia,Howson,6.699094e+09,22029 Cottonwood Crossing
40,50,Lorens,Kenwrick,8.456526e+09,938 Amoth Hill

In [39]:
query= """
select * from factura;
"""
pretty_select(query)

,id_factura,id_cliente,fecha_hora,banco,id_sucursal,total,descuento,total_pago
0,1,29,2020-07-01 18:00:00.122570,Provincial,2,384.0,0.0,384.0
1,2,18,2020-07-01 18:00:00.705029,Banesco,2,1904.0,0.0,1904.0
2,3,27,2020-07-01 18:00:00.101037,Mercantil,1,2.0,0.0,2.0
3,4,17,2020-07-01 18:00:00.704098,Provincial,1,325.0,0.0,325.0
4,5,40,2020-07-01 18:00:00.031355,Provincial,2,390.0,0.0,390.0
5,6,29,2020-07-01 18:00:00.031355,Mercantil,2,438.0,0.0,438.0
6,7,25,2020-07-01 18:00:00.066330,Provincial,1,120.0,0.0,120.0
7,8,34,2020-07-01 18:00:00.531155,Mercantil,1,95.0,0.0,95.0
8,9,40,2020-07-01 23:04:33.557845,Mercantil,1,41.0,0.0,41.0

In [40]:
query= """
select * from cuenta_programa_fidelidad;
"""
pretty_select(query)

,no_cuenta,id_cliente,fecha_suscripcion,fecha_finalizacion,foto,puntos
0,0,0,0001-01-01,0001-01-01,Ninguna,0
1,1,20,2020-07-01,2020-07-31,http://dummyimage.com/109x112.jpg/ff4444/ffffff,0
2,2,47,2020-07-01,2020-07-31,http://dummyimage.com/199x158.jpg/ff4444/ffffff,0
3,6,36,2020-07-01,2020-07-31,http://dummyimage.com/203x129.jpg/ff4444/ffffff,0
4,8,33,2020-07-01,2020-07-31,http://dummyimage.com/249x205.png/dddddd/000000,0
5,9,48,2020-07-01,2020-07-31,http://dummyimage.com/228x238.png/cc0000/ffffff,0
6,13,50,2020-07-01,2020-07-31,http://dummyimage.com/145x226.jpg/ff4444/ffffff,0
7,14,24,2020-07-01,2020-07-31,http://dummyimage.com/117x161.png/cc0000/ffffff,0
8,15,12,2020-07-01,2020-07-31,http://dummyimage.com/156x122.png/cc0000/ffffff,0
9,16,38,2020-07-01,2020-07-31,http://dummyimage.com/164x124.jpg/ff4444/ffffff,0
10,17,39,2020-07-01,2020-07-31,http://dummyimage.com/161x132.jpg/5fa2dd/ffffff,0
11,18,46,2020-07-01,2020-07-31,http://dummyimage.com/217x125.jpg/5fa2dd/ffffff,0
12,19,35,2020-07-01,2020-07-31,http://dummyimage.com/146x185.png/dddddd/000000,0
13,21,13,2020-07-01,2020-07-31,http://dummyimage.com/170x223.jpg/dddddd/000000,0
14,22,23,2020-07-01,2020-07-31,http://dummyimage.com/133x141.png/dddddd/000000,0
15,23,21,2020-07-01,2020-07-31,http://dummyimage.com/216x104.png/5fa2dd/ffffff,0
16,24,22,2020-07-01,2020-07-31,http://dummyimage.com/150x118.png/cc0000/ffffff,0
17,25,6,2020-07-01,2020-07-31,http://dummyimage.com/197x140.jpg/5fa2dd/ffffff,0
18,4,17,2020-07-01,2020-07-31,http://dummyimage.com/160x171.png/cc0000/ffffff,33
19,27,29,2020-07-01,2020-07-31,sin foto,0
20,28,25,2020-07-01,2020-07-31,sin foto,0
21,29,34,2020-07-01,2020-07-31,sin foto,0
22,26,40,2020-07-01,2020-07-31,sin foto,4
23,30,40,2020-07-01,2020-07-31,sin foto,0

## 3.

Si un cliente desconocido con la misma cedula compra mas de 4 veces, automáticamente se agregará al programa de fidelidad.

In [18]:
query="""
CREATE OR REPLACE FUNCTION add_to_programa() RETURNS TRIGGER AS
$$
BEGIN
    IF (SELECT COUNT(id_cliente) > 4 FROM factura) THEN 
    INSERT INTO cuenta_programa_fidelidad (no_cuenta, id_cliente, fecha_suscripcion, fecha_finalizacion) VALUES 
    ((SELECT no_cuenta+1 FROM cuenta_programa_fidelidad ORDER BY no_cuenta DESC LIMIT 1), NEW.id_cliente, DATE(NEW.fecha_hora), 
    DATE(NEW.fecha_hora)+30);
    END IF;
    
    RETURN NEW;
END;
$$
  LANGUAGE 'plpgsql';
"""
cur = connection.cursor()
cur.execute(query)
cur.close()
connection.commit()

In [19]:
query="""
CREATE TRIGGER add_to_programa
  AFTER INSERT 
  ON factura
  FOR EACH ROW
  EXECUTE PROCEDURE add_to_programa();
"""
cur = connection.cursor()
cur.execute(query)
cur.close()
connection.commit()

In [41]:
query= """
select * from factura;
"""
pretty_select(query)

,id_factura,id_cliente,fecha_hora,banco,id_sucursal,total,descuento,total_pago
0,1,29,2020-07-01 18:00:00.122570,Provincial,2,384.0,0.0,384.0
1,2,18,2020-07-01 18:00:00.705029,Banesco,2,1904.0,0.0,1904.0
2,3,27,2020-07-01 18:00:00.101037,Mercantil,1,2.0,0.0,2.0
3,4,17,2020-07-01 18:00:00.704098,Provincial,1,325.0,0.0,325.0
4,5,40,2020-07-01 18:00:00.031355,Provincial,2,390.0,0.0,390.0
5,6,29,2020-07-01 18:00:00.031355,Mercantil,2,438.0,0.0,438.0
6,7,25,2020-07-01 18:00:00.066330,Provincial,1,120.0,0.0,120.0
7,8,34,2020-07-01 18:00:00.531155,Mercantil,1,95.0,0.0,95.0
8,9,40,2020-07-01 23:04:33.557845,Mercantil,1,41.0,0.0,41.0

In [42]:
query= """
select * from cuenta_programa_fidelidad;
"""
pretty_select(query)

,no_cuenta,id_cliente,fecha_suscripcion,fecha_finalizacion,foto,puntos
0,0,0,0001-01-01,0001-01-01,Ninguna,0
1,1,20,2020-07-01,2020-07-31,http://dummyimage.com/109x112.jpg/ff4444/ffffff,0
2,2,47,2020-07-01,2020-07-31,http://dummyimage.com/199x158.jpg/ff4444/ffffff,0
3,6,36,2020-07-01,2020-07-31,http://dummyimage.com/203x129.jpg/ff4444/ffffff,0
4,8,33,2020-07-01,2020-07-31,http://dummyimage.com/249x205.png/dddddd/000000,0
5,9,48,2020-07-01,2020-07-31,http://dummyimage.com/228x238.png/cc0000/ffffff,0
6,13,50,2020-07-01,2020-07-31,http://dummyimage.com/145x226.jpg/ff4444/ffffff,0
7,14,24,2020-07-01,2020-07-31,http://dummyimage.com/117x161.png/cc0000/ffffff,0
8,15,12,2020-07-01,2020-07-31,http://dummyimage.com/156x122.png/cc0000/ffffff,0
9,16,38,2020-07-01,2020-07-31,http://dummyimage.com/164x124.jpg/ff4444/ffffff,0
10,17,39,2020-07-01,2020-07-31,http://dummyimage.com/161x132.jpg/5fa2dd/ffffff,0
11,18,46,2020-07-01,2020-07-31,http://dummyimage.com/217x125.jpg/5fa2dd/ffffff,0
12,19,35,2020-07-01,2020-07-31,http://dummyimage.com/146x185.png/dddddd/000000,0
13,21,13,2020-07-01,2020-07-31,http://dummyimage.com/170x223.jpg/dddddd/000000,0
14,22,23,2020-07-01,2020-07-31,http://dummyimage.com/133x141.png/dddddd/000000,0
15,23,21,2020-07-01,2020-07-31,http://dummyimage.com/216x104.png/5fa2dd/ffffff,0
16,24,22,2020-07-01,2020-07-31,http://dummyimage.com/150x118.png/cc0000/ffffff,0
17,25,6,2020-07-01,2020-07-31,http://dummyimage.com/197x140.jpg/5fa2dd/ffffff,0
18,4,17,2020-07-01,2020-07-31,http://dummyimage.com/160x171.png/cc0000/ffffff,33
19,27,29,2020-07-01,2020-07-31,sin foto,0
20,28,25,2020-07-01,2020-07-31,sin foto,0
21,29,34,2020-07-01,2020-07-31,sin foto,0
22,26,40,2020-07-01,2020-07-31,sin foto,4
23,30,40,2020-07-01,2020-07-31,sin foto,0

# extras

## 4.

Si la cantidad de producto en el inventario es suficiente para llenar el estante se procede a realizar el update, si no lanza un excepción.

# preguntas

## 1.

¿Cuáles son las categorías de producto que se venden mejor en cada una de las tiendas? Use un pivot table para razonar su respuesta.

In [63]:
query="""SELECT * FROM crosstab($$
select detalle_factura.id_producto, producto.categoria,  factura.id_sucursal from factura join detalle_factura on
factura.id_factura = detalle_factura.id_factura join producto on detalle_factura.id_producto = producto.id_producto where factura.id_sucursal = 1 $$, 
$$ SELECT 'Lácteos' UNION ALL
  SELECT 'Charcutería' UNION ALL
  SELECT 'Panadería' UNION ALL
  SELECT 'Bebidas' UNION ALL
  SELECT 'Cereales' UNION ALL
  SELECT 'Galletas' UNION ALL
  SELECT 'No Perecederos' UNION ALL
SELECT 'Vegetales' UNION ALL 
SELECT 'Frutas' UNION ALL
 SELECT 'Frescos' UNION ALL  
SELECT 'Enlatados' $$
) AS ct(categoria text, Lácteos text, Charcutería text, Panadería text, Bebidas text, Cereales text,
Galletas text, No_Perecederos text, Vegetales text, Frutas text, Frescos text, Enlatados text);"""
pretty_select(query)

,categoria,lácteos,charcutería,panadería,bebidas,cereales,galletas,no_perecederos,vegetales,frutas,frescos,enlatados
0,16,None,None,None,None,1,None,None,None,None,None,None
1,8,None,None,1,None,None,None,None,None,None,None,None
2,22,None,1,None,None,None,None,None,None,None,None,None
3,8,None,None,1,None,None,None,None,None,None,None,None
4,7,1,None,None,None,None,None,None,None,None,None,None
5,3,1,None,None,None,None,None,None,None,None,None,None

In [64]:
query="""SELECT * FROM crosstab($$
select detalle_factura.id_producto, producto.categoria,  factura.id_sucursal from factura join detalle_factura on
factura.id_factura = detalle_factura.id_factura join producto on detalle_factura.id_producto = producto.id_producto where factura.id_sucursal = 2 $$, 
$$ SELECT 'Lácteos' UNION ALL
  SELECT 'Charcutería' UNION ALL
  SELECT 'Panadería' UNION ALL
  SELECT 'Bebidas' UNION ALL
  SELECT 'Cereales' UNION ALL
  SELECT 'Galletas' UNION ALL
  SELECT 'No Perecederos' UNION ALL
SELECT 'Vegetales' UNION ALL 
SELECT 'Frutas' UNION ALL
 SELECT 'Frescos' UNION ALL  
SELECT 'Enlatados' $$
) AS ct(categoria text, Lácteos text, Charcutería text, Panadería text, Bebidas text, Cereales text,
Galletas text, No_Perecederos text, Vegetales text, Frutas text, Frescos text, Enlatados text);"""
pretty_select(query)

,categoria,lácteos,charcutería,panadería,bebidas,cereales,galletas,no_perecederos,vegetales,frutas,frescos,enlatados
0,35,None,None,None,None,None,None,2,None,None,None,None
1,45,None,None,None,None,None,None,None,None,None,2,None
2,44,None,None,None,None,None,None,None,None,2,None,None
3,35,None,None,None,None,None,None,2,None,None,None,None
4,32,None,None,None,None,None,None,2,None,None,None,None

## 2.

¿Qué banco, categoría de producto y tienda prefieren los clientes de nuestro programa de afiliados? Razone su respuesta.

In [65]:
query= """
select count(factura.id_factura), factura.banco from factura join cuenta_programa_fidelidad on 
factura.id_cliente = cuenta_programa_fidelidad.id_cliente group by 2;
"""
pretty_select(query)

   count       banco
0      4   Mercantil
1      5  Provincial

In [66]:
query= """
select count(factura.id_factura), factura.id_sucursal from factura join cuenta_programa_fidelidad on 
factura.id_cliente = cuenta_programa_fidelidad.id_cliente group by 2;
"""
pretty_select(query)

   count  id_sucursal
0      5            1
1      4            2

In [67]:
query= """
select count(detalle_factura.id_producto), producto.categoria from factura join detalle_factura on factura.id_factura = detalle_factura.id_factura 
join cuenta_programa_fidelidad on factura.id_cliente = cuenta_programa_fidelidad.id_cliente 
join producto on producto.id_producto = detalle_factura.id_producto group by 2;
"""
pretty_select(query)

   count       categoria
0      3         Lácteos
1      2       Panadería
2      3  No Perecederos
3      1     Charcutería
4      2          Frutas

## 3.

¿Qué horas del día son más rentable para cada una de las tiendas? Razone su respuesta.

In [49]:
query="""SELECT COUNT(id_cliente), fecha_hora FROM factura WHERE id_sucursal = 1 GROUP BY id_cliente,fecha_hora """
pretty_select(query)

   count                 fecha_hora
0      1 2020-07-01 18:00:00.704098
1      1 2020-07-01 18:00:00.066330
2      1 2020-07-01 18:00:00.101037
3      1 2020-07-01 18:00:00.531155
4      1 2020-07-01 23:04:33.557845

In [50]:
query="""SELECT COUNT(id_cliente), fecha_hora FROM factura WHERE id_sucursal = 2 GROUP BY id_cliente,fecha_hora """
pretty_select(query)

   count                 fecha_hora
0      1 2020-07-01 18:00:00.705029
1      1 2020-07-01 18:00:00.031355
2      1 2020-07-01 18:00:00.122570
3      1 2020-07-01 18:00:00.031355

# conectar e iniciar suscriptor

In [7]:
## se crea un suscriptor y se conecta 
suscriptor = sub.suscriptor(connection)
suscriptor.conectar_suscriptor()

connected (b'')
{'id_producto': 8, 'cantidad': 11, 'id_estante': 3, 'sucursal': 'sucursal1', 'hora': '2020-07-01 18:00:00.289470'}
---------------------------------------------------------
datos guardados
{'sucursal': 'sucursal2', 'id_cliente': 48, 'id_sucursal': 2}
---------------------------------------------------------
{'id_producto': 43, 'cantidad': 11, 'id_estante': 15, 'sucursal': 'sucursal2', 'hora': '2020-07-01 18:00:00.113614'}
---------------------------------------------------------
datos guardados
{'sucursal': 'sucursal2', 'id_cliente': 40, 'id_sucursal': 2}
---------------------------------------------------------
{'id_producto': 35, 'cantidad': 96, 'id_estante': 12, 'sucursal': 'sucursal2', 'hora': '2020-07-01 18:00:00.122570'}
---------------------------------------------------------
datos guardados
{'sucursal': 'sucursal2', 'id_cliente': 31, 'id_sucursal': 2}
---------------------------------------------------------
{'id_producto': 34, 'cantidad': 171, 'id_estante': 12, 'sucursal': 'sucursal2', 'hora': '2020-07-01 18:00:00.752353'}
---------------------------------------------------------
datos guardados
{'id_producto': 26, 'cantidad': 20, 'id_estante': 9, 'sucursal': 'sucursal2', 'hora': '2020-07-01 18:00:00.967394'}
---------------------------------------------------------
datos guardados
{'sucursal': 'sucursal2', 'id_cliente': 3, 'id_sucursal': 2}
---------------------------------------------------------
{'id_producto': 32, 'cantidad': 10, 'id_estante': 11, 'sucursal': 'sucursal2', 'hora': '2020-07-01 19:00:00.263007'}
---------------------------------------------------------
datos guardados
{'sucursal': 'sucursal1', 'id_cliente': 15, 'id_sucursal': 1}
---------------------------------------------------------
{'sucursal': 'sucursal1', 'id_cliente': 34, 'id_sucursal': 1}
---------------------------------------------------------
{'sucursal': 'sucursal1', 'id_cliente': 21, 'id_sucursal': 1}
---------------------------------------------------------
{'sucursal': 'sucursal1', 'id_cliente': 4, 'id_sucursal': 1}
---------------------------------------------------------
{'id_producto': 41, 'cantidad': 52, 'id_estante': 14, 'sucursal': 'sucursal2', 'hora': '2020-07-01 18:00:00.574179'}
---------------------------------------------------------
datos guardados
{'sucursal': 'sucursal1', 'id_cliente': 36, 'id_sucursal': 1}
---------------------------------------------------------
{'sucursal': 'sucursal2', 'id_cliente': 8, 'id_sucursal': 2}
---------------------------------------------------------
{'sucursal': 'sucursal2', 'id_cliente': 10, 'id_sucursal': 2}
---------------------------------------------------------
{'id_producto': 42, 'cantidad': 111, 'id_estante': 15, 'sucursal': 'sucursal2', 'hora': '2020-07-01 18:00:00.738835'}
---------------------------------------------------------
datos guardados
{'sucursal': 'sucursal2', 'id_cliente': 28, 'id_sucursal': 2}
---------------------------------------------------------
{'sucursal': 'sucursal1', 'id_cliente': 26, 'id_sucursal': 1}
---------------------------------------------------------
{'id_producto': 45, 'cantidad': 68, 'id_estante': 16, 'sucursal': 'sucursal2', 'hora': '2020-07-01 18:00:00.705029'}
---------------------------------------------------------
datos guardados
{'id_producto': 16, 'cantidad': 1, 'id_estante': 6, 'sucursal': 'sucursal1', 'hora': '2020-07-01 18:00:00.101037'}
---------------------------------------------------------
datos guardados
{'id_producto': 37, 'cantidad': 10, 'id_estante': 13, 'sucursal': 'sucursal2', 'hora': '2020-07-01 18:00:00.948011'}
---------------------------------------------------------
datos guardados
{'sucursal': 'sucursal2', 'id_cliente': 38, 'id_sucursal': 2}
---------------------------------------------------------
{'id_producto': 22, 'cantidad': 4, 'id_estante': 8, 'sucursal': 'sucursal1', 'hora': '2020-07-01 18:00:00.035854'}
---------------------------------------------------------
datos guardados
{'sucursal': 'sucursal1', 'id_cliente': 20, 'id_sucursal': 1}
---------------------------------------------------------
{'id_producto': 34, 'cantidad': 8, 'id_estante': 12, 'sucursal': 'sucursal2', 'hora': '2020-07-01 18:00:00.031355'}
---------------------------------------------------------
datos guardados
{'id_producto': 44, 'cantidad': 30, 'id_estante': 16, 'sucursal': 'sucursal2', 'hora': '2020-07-01 18:00:00.031355'}
---------------------------------------------------------
datos guardados
{'id_producto': 32, 'cantidad': 6, 'id_estante': 11, 'sucursal': 'sucursal2', 'hora': '2020-07-01 18:00:00.031355'}
---------------------------------------------------------
datos guardados
{'id_producto': 1, 'cantidad': 8, 'id_estante': 1, 'sucursal': 'sucursal1', 'hora': '2020-07-01 18:00:00.855387'}
---------------------------------------------------------
datos guardados
{'id_producto': 45, 'cantidad': 31, 'id_estante': 16, 'sucursal': 'sucursal2', 'hora': '2020-07-01 18:00:00.855387'}
---------------------------------------------------------
datos guardados
{'id_producto': 8, 'cantidad': 8, 'id_estante': 3, 'sucursal': 'sucursal1', 'hora': '2020-07-01 18:00:00.951917'}
---------------------------------------------------------
datos guardados
{'id_producto': 37, 'cantidad': 87, 'id_estante': 13, 'sucursal': 'sucursal2', 'hora': '2020-07-01 18:00:00.066330'}
---------------------------------------------------------
datos guardados
{'id_producto': 7, 'cantidad': 5, 'id_estante': 3, 'sucursal': 'sucursal1', 'hora': '2020-07-01 18:00:00.531155'}
---------------------------------------------------------
datos guardados
{'id_producto': 40, 'cantidad': 106, 'id_estante': 14, 'sucursal': 'sucursal2', 'hora': '2020-07-01 18:00:00.111291'}
---------------------------------------------------------
datos guardados

ERROR:root:Internal Python error in the inspect module.
Below is the traceback from this internal error.

Traceback (most recent call last):
  File "C:\ProgramData\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py", line 2963, in run_code
    exec(code_obj, self.user_global_ns, self.user_ns)
  File "<ipython-input-7-d6065d784ee7>", line 3, in <module>
    suscriptor.conectar_suscriptor()
  File "C:\Users\Ramon Decena\Proyecto 1 Final\sub.py", line 64, in conectar_suscriptor
    self.client.loop_forever()
  File "C:\ProgramData\Anaconda3\lib\site-packages\paho\mqtt\client.py", line 1481, in loop_forever
    rc = self.loop(timeout, max_packets)
  File "C:\ProgramData\Anaconda3\lib\site-packages\paho\mqtt\client.py", line 988, in loop
    socklist = select.select(rlist, wlist, [], timeout)
KeyboardInterrupt

During handling of the above exception, another exception occurred:

Traceback (most recent call last):
  File "C:\ProgramData\Anaconda3\lib\site-packages\IPython\core\interactiveshell.py", line 1863, in showtraceback
    stb = value._render_traceback_()
AttributeError: 'KeyboardInterrupt' object has no attribute '_render_traceback_'

During handling of the above exception, another exception occurred:

Traceback (most recent call last):
  File "C:\ProgramData\Anaconda3\lib\site-packages\IPython\core\ultratb.py", line 1095, in get_records
    return _fixed_getinnerframes(etb, number_of_lines_of_context, tb_offset)
  File "C:\ProgramData\Anaconda3\lib\site-packages\IPython\core\ultratb.py", line 311, in wrapped
    return f(*args, **kwargs)
  File "C:\ProgramData\Anaconda3\lib\site-packages\IPython\core\ultratb.py", line 345, in _fixed_getinnerframes
    records = fix_frame_records_filenames(inspect.getinnerframes(etb, context))
  File "C:\ProgramData\Anaconda3\lib\inspect.py", line 1483, in getinnerframes
    frameinfo = (tb.tb_frame,) + getframeinfo(tb, context)
  File "C:\ProgramData\Anaconda3\lib\inspect.py", line 1441, in getframeinfo
    filename = getsourcefile(frame) or getfile(frame)
  File "C:\ProgramData\Anaconda3\lib\inspect.py", line 696, in getsourcefile
    if getattr(getmodule(object, filename), '__loader__', None) is not None:
  File "C:\ProgramData\Anaconda3\lib\inspect.py", line 739, in getmodule
    f = getabsfile(module)
  File "C:\ProgramData\Anaconda3\lib\inspect.py", line 708, in getabsfile
    _filename = getsourcefile(object) or getfile(object)
  File "C:\ProgramData\Anaconda3\lib\inspect.py", line 693, in getsourcefile
    if os.path.exists(filename):
  File "C:\ProgramData\Anaconda3\lib\genericpath.py", line 19, in exists
    os.stat(path)
KeyboardInterrupt

KeyboardInterrupt: